// ::::::::::::::::::::::::::::::::::::::::::::::::::::::::
// Ajax :::::::::::::::::::::::::::::::::::::::::::::::::::

ajaxStart
// данное событие возникает в случае когда побежал первый 
// AJAX запрос, и при этом других активных AJAX запросов в 
// данный момент нет 

beforeSend
// возникает до отправки запроса, позволяет редактировать 
// XMLHttpRequest, локальное событие

ajaxSend
// возникает до отправки запроса, аналогично beforeSend

success
// возникает по возвращению ответа, когда нет ошибок ни 
// сервера, ни вернувшихся данных, локальное событие

ajaxSuccess
// возникает по возвращению ответа, аналогично success

error
// возникает в случае ошибки, локальное событие

ajaxError
// возникает в случае ошибки

complete
// возникает по завершению текущего AJAX запроса 
// (с ошибкой или без — срабатывает всегда), локальное событие

ajaxComplete
// глобальное событие, аналогичное complete

ajaxStop
// данное событие возникает в случае, когда больше нету 
// активных запросов